zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32l4xx/drivers/src/stm32l4xx_hal_dsi.c
  if((ActiveErrors & HAL_DSI_ERROR_EOT) != 0U)
  {
    /* Enable the interrupt generation on selected errors */
    hdsi->Instance->IER[1U] |= DSI_ERROR_EOT_MASK;
  }

  if((ActiveErrors & HAL_DSI_ERROR_OVF) != 0U)
  {
    /* Enable the interrupt generation on selected errors */
    hdsi->Instance->IER[1U] |= DSI_ERROR_OVF_MASK;
  }

  if((ActiveErrors & HAL_DSI_ERROR_GEN) != 0U)
  {
    /* Enable the interrupt generation on selected errors */
    hdsi->Instance->IER[1U] |= DSI_ERROR_GEN_MASK;
  }

  /* Process Unlocked */
  __HAL_UNLOCK(hdsi);

  return HAL_OK;
}

/**
  * @brief  Initializes the DSI MSP.
  * @param  hdsi  pointer to a DSI_HandleTypeDef structure that contains
  *               the configuration information for the DSI.
  * @retval None
  */
__weak void HAL_DSI_MspInit(DSI_HandleTypeDef* hdsi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdsi);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DSI_MspInit could be implemented in the user file
   */
}

/**
  * @brief  De-initializes the DSI MSP.
  * @param  hdsi  pointer to a DSI_HandleTypeDef structure that contains
  *               the configuration information for the DSI.
  * @retval None
  */
__weak void HAL_DSI_MspDeInit(DSI_HandleTypeDef* hdsi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdsi);
  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DSI_MspDeInit could be implemented in the user file
   */
}

#if (USE_HAL_DSI_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User DSI Callback
  *         To be used instead of the weak predefined callback
  * @param hdsi dsi handle
  * @param CallbackID ID of the callback to be registered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_DSI_TEARING_EFFECT_CB_ID Tearing Effect Callback ID
  *          @arg @ref HAL_DSI_ENDOF_REFRESH_CB_ID End Of Refresh Callback ID
  *          @arg @ref HAL_DSI_ERROR_CB_ID Error Callback ID
  *          @arg @ref HAL_DSI_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_DSI_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param pCallback pointer to the Callback function
  * @retval status
  */
HAL_StatusTypeDef HAL_DSI_RegisterCallback(DSI_HandleTypeDef *hdsi, HAL_DSI_CallbackIDTypeDef CallbackID, pDSI_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  if(pCallback == NULL)
  {
    /* Update the error code */
    hdsi->ErrorCode |= HAL_DSI_ERROR_INVALID_CALLBACK;

    return HAL_ERROR;
  }
  /* Process locked */
  __HAL_LOCK(hdsi);

  if(hdsi->State == HAL_DSI_STATE_READY)
  {
    switch (CallbackID)
    {
    case HAL_DSI_TEARING_EFFECT_CB_ID :
      hdsi->TearingEffectCallback = pCallback;
      break;

    case HAL_DSI_ENDOF_REFRESH_CB_ID :
      hdsi->EndOfRefreshCallback = pCallback;
      break;

    case HAL_DSI_ERROR_CB_ID :
      hdsi->ErrorCallback = pCallback;
      break;

    case HAL_DSI_MSPINIT_CB_ID :
      hdsi->MspInitCallback = pCallback;
      break;

   case HAL_DSI_MSPDEINIT_CB_ID :
      hdsi->MspDeInitCallback = pCallback;
      break;

    default :
      /* Update the error code */
      hdsi->ErrorCode |= HAL_DSI_ERROR_INVALID_CALLBACK;
      /* Return error status */
      status =  HAL_ERROR;
      break;
    }
  }
  else if(hdsi->State == HAL_DSI_STATE_RESET)
  {
    switch (CallbackID)
    {
    case HAL_DSI_MSPINIT_CB_ID :
      hdsi->MspInitCallback = pCallback;
      break;

   case HAL_DSI_MSPDEINIT_CB_ID :
      hdsi->MspDeInitCallback = pCallback;
      break;

    default :
      /* Update the error code */
      hdsi->ErrorCode |= HAL_DSI_ERROR_INVALID_CALLBACK;
      /* Return error status */
      status =  HAL_ERROR;
      break;
    }
  }
  else
  {
    /* Update the error code */
    hdsi->ErrorCode |= HAL_DSI_ERROR_INVALID_CALLBACK;
    /* Return error status */
    status =  HAL_ERROR;
  }

  /* Release Lock */
  __HAL_UNLOCK(hdsi);

  return status;
}

/**
  * @brief  Unregister a DSI Callback
  *         DSI callabck is redirected to the weak predefined callback
  * @param hdsi dsi handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_DSI_TEARING_EFFECT_CB_ID Tearing Effect Callback ID
  *          @arg @ref HAL_DSI_ENDOF_REFRESH_CB_ID End Of Refresh Callback ID
  *          @arg @ref HAL_DSI_ERROR_CB_ID Error Callback ID
  *          @arg @ref HAL_DSI_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_DSI_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval status
  */
HAL_StatusTypeDef HAL_DSI_UnRegisterCallback(DSI_HandleTypeDef *hdsi, HAL_DSI_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Process locked */
  __HAL_LOCK(hdsi);

  if(hdsi->State == HAL_DSI_STATE_READY)
  {
    switch (CallbackID)
    {
    case HAL_DSI_TEARING_EFFECT_CB_ID :
      hdsi->TearingEffectCallback = HAL_DSI_TearingEffectCallback; /* Legacy weak TearingEffectCallback */
      break;

    case HAL_DSI_ENDOF_REFRESH_CB_ID :
      hdsi->EndOfRefreshCallback = HAL_DSI_EndOfRefreshCallback;   /* Legacy weak EndOfRefreshCallback  */
      break;

    case HAL_DSI_ERROR_CB_ID :
      hdsi->ErrorCallback        = HAL_DSI_ErrorCallback;          /* Legacy weak ErrorCallback        */
      break;

    case HAL_DSI_MSPINIT_CB_ID :
      hdsi->MspInitCallback = HAL_DSI_MspInit;                     /* Legcay weak MspInit Callback     */
      break;

   case HAL_DSI_MSPDEINIT_CB_ID :
      hdsi->MspDeInitCallback = HAL_DSI_MspDeInit;                 /* Legcay weak MspDeInit Callback   */
      break;

    default :
      /* Update the error code */
      hdsi->ErrorCode |= HAL_DSI_ERROR_INVALID_CALLBACK;
     /* Return error status */
      status =  HAL_ERROR;
      break;
    }
  }
  else if(hdsi->State == HAL_DSI_STATE_RESET)
  {
    switch (CallbackID)
    {
    case HAL_DSI_MSPINIT_CB_ID :
      hdsi->MspInitCallback = HAL_DSI_MspInit;                  /* Legcay weak MspInit Callback   */
      break;

